{
    "Classes": [
        {
            "Day": "",
            "Time": "",
            "Instructor": "",
            "Location": "",
            "Description": "Make a splash with this energizing, low-impact workout designed to improve strength, flexibility, and cardiovascular health! Using the natural resistance of water, this class delivers total-body conditioning that’s gentle on the joints yet highly effective. Perfect for all fitness levels in a supportive, upbeat atmosphere.",
            "Class Name": "Aqua Fit - Water Aerobics"
        },
        {
            "Day": "",
            "Time": "",
            "Instructor": "",
            "Location": "",
            "Description": "Experience the ultimate low-impact, high-intensity workout with this class! This unique class combines the cardio benefits of cycling with the resistance of water for a joint-friendly, full-body challenge. Improve endurance, core stability, and boost your energy in a fun, refreshing environment suitable for all fitness levels.",
            "Class Name": "Aqua Spin"
        },
        {
            "Day": "",
            "Time": "",
            "Instructor": "",
            "Location": "",
            "Description": "Break up your day with this 30-minute movement-focused class designed to improve flexibility, joint health, and overall range of motion. Through dynamic stretches, controlled mobility drills, and posture-enhancing exercises, you’ll loosen tight muscles, reduce stiffness, and boost energy for the rest of your day. Perfect for all fitness levels, this express session helps you move better, feel better, and finish your day refreshed and ready.",
            "Class Name": "Midday Mobility"
        },
        {
            "Day": "",
            "Time": "",
            "Instructor": "",
            "Location": "",
            "Description": "Start your day strong with this energizing HIIT workout designed to wake up your body and mind! Rev Up combines quick cardio bursts and strength intervals to maximize results in just 30 minutes. You’ll leave feeling invigorated, focused, and ready to tackle the day ahead. All fitness levels welcome – kick off your morning with power and positivity!",
            "Class Name": "Rev Up"
        },
        {
            "Day": "",
            "Time": "",
            "Instructor": "",
            "Location": "",
            "Description": "Come experience group fitness with this indoor cycling class - an energetic, music-driven spin class that fuels your body and fires up your mood. This class is designed to boost cardiovascular fitness, strengthen your legs and core, and leave you feeling empowered. Whether you’re a seasoned rider or new to the bike, Spin Surge delivers a fun, sweat-filled journey that will have you coming back for more!",
            "Class Name": "Spin Surge"
        },
        {
            "Day": "",
            "Time": "",
            "Instructor": "",
            "Location": "",
            "Description": "Blast through your limits with this high intensity interval training class! Turbo Fit combines powerful cardio bursts with strength-building moves for a total-body challenge that boosts endurance, burns calories, and builds lean muscle. With motivating music and dynamic intervals, you’ll leave feeling strong, energized, and unstoppable. Perfect for all fitness levels – just bring your drive and get ready to turbocharge your workout!",
            "Class Name": "Turbo Fit"
        }
    ],
    "Current Time": "2026-02-10 00:12:52"
}